[Killed] BooleanLiteral
src/utilitarios.js:88:9
   }
 
   mediaArray(arr) {
-    if (!arr.length) return 0;
+    if (arr.length) return 0;
     return arr.reduce((a, b) => a + b, 0) / arr.length;
   }
killedBy: Utilitarios Realiza o calculo da media dos valores de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/utilitarios.js:98:12
 
   ehPalindromo(str) {
     const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-    return limpo === limpo.split("").reverse().join("");
+    return limpo !== limpo.split("").reverse().join("");
   }
 
killedBy: Utilitarios Verifica se duas palavras são um palindromo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
